## LIST

In [1]:
pop = [30.50,2.88,39.11]
countries=["China","India","Albania"]

In [2]:
alb= countries.index('Albania')

In [3]:
alb

2

In [4]:
pop[alb]

39.11

## DICTIONARIES

In [5]:
world = {'China':30.50,'India':2.88,'Albania':39.11}

In [6]:
world

{'China': 30.5, 'India': 2.88, 'Albania': 39.11}

In [7]:
world['India']

2.88

In [8]:
world_dic = {
    "countries": ['China', 'India', 'Albania'],
    "population": [30.50, 2.88, 39.11]
}

In [10]:
world_dic['countries'][2]

'Albania'

### Dataframe (table)

In [11]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\teacher\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\teacher\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\teacher\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\teacher\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\teacher\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\teacher\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame(world_dic)

In [14]:
df

  countries  population
0     China       30.50
1     India        2.88
2   Albania       39.11

In [19]:
#column extraction METHOD-1
df.countries

0      China
1      India
2    Albania
Name: countries, dtype: object

In [20]:
#column extraction METHOD-2
df["countries"]

0      China
1      India
2    Albania
Name: countries, dtype: object

In [16]:
print(type(df), type(df.countries))

<class 'pandas.core.frame.DataFrame'> <class 'pandas.core.series.Series'>

## Dataframe methods

In [28]:
df.head(2)

  countries  population
0     China       30.50
1     India        2.88

In [22]:
df.tail(2)

  countries  population
1     India        2.88
2   Albania       39.11

In [24]:
df.sample()

  countries  population
1     India        2.88

In [25]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [26]:
df.columns

Index(['countries', 'population'], dtype='object')

In [29]:
df.shape

(3, 2)

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   countries   3 non-null      object
 1   population  3 non-null      float64
dtypes: float64(1), object(1)
memory usage: 180.0+ bytes

In [33]:
df.rename(columns={'countries': "col1", 'population': 'col2'})

      col1   col2
0    China  30.50
1    India   2.88
2  Albania  39.11

In [44]:
bricks = {"country": ['Brazil', 'Russia', 'India', 'China', 'South Africa'],
         "capital": ['Brazilia', 'Moscow', 'New Delhi', 'Beijing', 'Pretoria'],
         "area": [8.516, 17.100, 3.286, 9.597, 1.221],
         "population": [200.40, 143.50, 1252.00, 1357.00, 52.98]}

bricks_df = pd.DataFrame(bricks)
bricks_df.set_index("country", inplace=True)

In [45]:
bricks_df

                capital    area  population
country
Brazil         Brazilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98